[
  {
    "id": 245761081513,
    "title": "3D Printer Accessories & Consumable",
    "handle": "3d-printer-accessories-and-consumable",
    "description": "Our store offer a large range of spare parts, upgrades and filament for 3D Printer. A large range of specific spares and upgrades parts for Creality Ender Series , K1 Series Parts, Voron DIY 3D Printers.",
    "published_at": "2021-02-11T21:21:06+10:00",
    "updated_at": "2026-02-18T20:20:14+10:00",
    "products_count": 1736
  },
  {
    "id": 276681031849,
    "title": "3D Printer Bearing & POM Wheels",
    "handle": "3d-printer-bearing-pom-wheels",
    "description": "Explore our extensive range of high-quality Bearings and POM Wheels intended specifically for 3D printers but not limited. These components are engineered for precision and durability, ensuring smooth operation and optimal performance in your printing projects or replace worn motion parts.",
    "published_at": "2021-09-06T19:12:39+10:00",
    "updated_at": "2026-02-10T22:12:15+10:00",
    "products_count": 27
  },
  {
    "id": 293124964521,
    "title": "3D Printer Bed",
    "handle": "3d-printer-bed",
    "description": "We stock a diverse range of replacement 3D printer bed plates, including original PCB options as well as upgraded cast aluminum and graphite build plates, tailored for Creality 3D printers and DIY Voron, ZeroG 3D printers. Ensure optimal adhesion, durability, and performance in your 3D printing projects with our high-quality bed plate solutions.\nComparison of Bed Plate Materials\n\n\n\n\nMaterial\nBenefits\nCons\n\n\n\n\nPCB (Printed Circuit Board)\n- Good for basic applications - Lightweight and cost-effective - Works well with many filaments\n- Less durable compared to aluminum or graphite - Can warp over time with high temperatures\n\n\nCast Aluminum\n- Excellent heat distribution - Durable and long-lasting - Provides good flatness\n- Heavier than other options - Can be more expensive upfront, require heat soak\n\n\nGraphite\n- Highly resistant to warping - Good thermal conductivity, minimal heat soak\n- Can be prone to scratches/dents - Needs careful handling to avoid damage\n\n\n\n \nChoosing the right bed plate material depends on your specific needs and printing requirements. PCB plates are budget-friendly but less durable, while cast aluminum offers durability and excellent heat distribution at a higher cost. Graphite plates provide lightweight options with great heat conductivity, but may require more care during use. Evaluate the benefits and cons to find the best fit for your 3D printing endeavors!",
    "published_at": "2023-01-27T11:54:05+10:00",
    "updated_at": "2026-02-16T22:13:01+10:00",
    "products_count": 25
  },
  {
    "id": 290623783081,
    "title": "3D Printer Bed Probe",
    "handle": "3d-printer-bed-probe",
    "description": "Discover our extensive range of 3D printing bed probe solutions that make achieving easier first layers and improved print adhesion a breeze. Our innovative technologies ensure accurate and hassle-free leveling, along with reliable replacement parts.\n\nOur Product Offerings:\n\n\n\n\n\nProbe Type\nOffering\n\n\n\n\nLegacy Probes\n\nBLTouch, CRTouch, Micro Probe\n\n\n\nDockable Probes\n\nKlicky Probe (PCB), Eureka\n\n\n\nEddy Tech Probes\nCartographer\n\n\nInductive Probes\n\nPZ Probe, Voron Tap\n\n\n\n\n\n\nKey Advantages:\n\n\n\n Easier First Layers  : Optimise initial layer adhesion and reduce print failures.\n\n Improved Print Adhesion  : Specialised probes designed to enhance adhesion across different materials.\n\n Accurate Leveling Upgrades  : Benefit from precise measurements, ensuring your printer is always leveled correctly.\n\n Hassle-Free Replacement Parts   : Seamless integration with existing setups for quick upgrades\n\n\nWhy Choose Us?\n\nOur products are at the forefront of 3D printing technology, providing reliable solutions tailored to your printing needs. Whether you're using legacy systems or seeking the latest advancements, we have the right tools for you.",
    "published_at": "2022-11-03T11:19:47+10:00",
    "updated_at": "2026-02-17T22:12:50+10:00",
    "products_count": 25
  },
  {
    "id": 270734262441,
    "title": "3D Printer Build Surfaces and Accessories",
    "handle": "3d-printer-bed-surface-accessories",
    "description": "Explore our range of 3D Printer Bed and Build Surfaces and associated accessories for a smooth and reliable first layer, stock available in Brisbane, Australia.\nAt DREMC, we offer high-quality replacement printing surfaces and beds in various sizes to suit most 3D printers, including Creality, Voron, Bambu, Prusa, Anycubic, and more! Our surfaces are finished in satin, textured PEI, and smooth PEI steel flex sheets, suitable for a range of materials and desired first layer textures without compromising reliability.\nUnsure which option best suits you? Check out our blog post here, or contact us!\nDon’t see the size you need? Reach out to us for custom sizes.\nWe also offer bed probes from Cartographer for accurate and fast mesh offsets, along with OEM bed probes for Creality printers, such as BL Touch, CR Touch, and popular community alternatives like Klicky or Voron Tap.",
    "published_at": "2021-06-30T21:57:23+10:00",
    "updated_at": "2026-02-17T22:12:50+10:00",
    "products_count": 102
  },
  {
    "id": 246452945065,
    "title": "3D Printer DC Fans",
    "handle": "3d-printer-fans",
    "description": "Explore our selection of universal 3D printer fans, designed for optimal cooling solutions from hotend, part cooling to mainboard for a 3d printer. Available in both 12V and 24V options, these fans are perfect for upgrades and replacements, ensuring your printer operates efficiently and effectively.\nKey Features\n\n\nVersatile Compatibility: Suitable for a variety of 3D printers, including Voron, Creality, Bambu Labs, and Sovol, making them a great choice for any setup.\n\n\nUpgrade and Replacement Options: Whether you're looking to enhance your printer's cooling performance or replace a failing fan, we have options to meet your needs.\n\n\nAvailable Brands\nWe stock a range of high-quality fans from trusted manufacturers:\n\n\nGDSTime: Known for their durable and efficient cooling solutions by the Voron Community\n\n\nDevil Design:  High RPM 5015 to suit a range of printer tool heads.\n\n\nLDO Motors: Trusted components designed for performance and reliability, replacement for their 3D Printers Kits\n\n\nFabreeko: High-quality and RPM fans suitable for DIY Builds.\n\n\nWest3D (Berserker Vindr): Performance-driven fans ideal for demanding environments and high flow requirements. \n\n\nDREMC: A range of DREMC focus on high speed/performance and reliability fans \n\nReplacement Fans\nIn addition to our universal options, we also offer replacement fans specifically designed for popular printer models, including Creality, Bambu, Anycubic and Sovol 3D printers.",
    "published_at": "2021-02-19T20:48:41+10:00",
    "updated_at": "2026-02-17T22:12:50+10:00",
    "products_count": 83
  },
  {
    "id": 275209257129,
    "title": "3D Printer Displays",
    "handle": "3d-printer-displays",
    "description": "If you need a replacement display for your 3D printer, you will find OEM(Creality Screens) display or touchscreen in our range. You can also upgrade your 3D printer with a display upgrade such touch screen or extended functionality.",
    "published_at": "2021-08-17T09:13:09+10:00",
    "updated_at": "2026-02-16T22:13:01+10:00",
    "products_count": 27
  },
  {
    "id": 277448327337,
    "title": "3D Printer Electronics",
    "handle": "3d-printer-electronics",
    "description": "Replacement or upgrades for 3D printer from reliable or original manufacturers, from mainboards and motors to fans and power supplies. Quality components, local support, fast shipping.",
    "published_at": "2021-09-15T23:34:01+10:00",
    "updated_at": "2026-02-17T22:12:50+10:00",
    "products_count": 305
  },
  {
    "id": 246066249897,
    "title": "3D Printer Extruder",
    "handle": "3d-printer-extruder",
    "description": "DREMC stocks a wide range of high-quality extruders for 3D printing from reputable OEM manufacturers, including Creality models such as the Ender 3, Ender 5, K1, and K2 printers. Our selection also includes extruders compatible with Anycubic, Flashforge, Qidi, and more.\nIn addition to OEM options, we offer a substantial range of aftermarket extruders for DIY Voron 3D printers and upgrade conversions for Creality models from leading manufacturers like Bondtech, LDO Motors, Micro Swiss, and Phaetus. This variety ensures that you can find the perfect extruder to enhance your printing performance and meet your specific project needs.\n\n\n\n\nWhere applicable, we also offer replacement gears and bearings that can be individually replaced due to wear. This ensures smooth extrusion and optimal performance for your 3D printer. Keeping these components in top condition is essential for preventing printing issues and maintaining high-quality results.",
    "published_at": "2021-02-15T18:34:39+10:00",
    "updated_at": "2026-02-17T22:12:50+10:00",
    "products_count": 153
  },
  {
    "id": 278225682601,
    "title": "3D Printer Extruder Spares",
    "handle": "3d-printer-extruder-spares",
    "description": "Explore our range of high-quality extruder spares for your 3D printer. Sourced from top brands like E3D, Bondtech, Micro Swiss or the original manufacturer such as Creality, these spares are designed to enhance your printing experience. Shop now for reliable and durable extruder parts.",
    "published_at": "2021-09-28T15:25:05+10:00",
    "updated_at": "2026-02-17T22:12:50+10:00",
    "products_count": 92
  },
  {
    "id": 275398361257,
    "title": "3D Printer Heat Breaks",
    "handle": "3d-printer-heat-breaks",
    "description": "Explore our range of high-quality heat breaks for 3D printer hotends at DREMC. We offer original replacement heat breaks compatible with Creality/Prusa 3D, Micro Swiss 3D printers hotends, as well as upgrade options with all-metal designs to replace older stock PTFE heat breaks, which can degrade over time.\nAll-metal solutions utilise mixed materials to reduce heat creep, prevent clogging, and enhance reliability. Notable options include the Slice Engineering Copperhead Heat Break, known for its superior performance and support a range of hotends from different manufacturers. \nIn addition, we stock replacement heat breaks for all hotends in our inventory, ensuring you have the necessary parts on hand if you encounter wear or filament blobs. Our selection includes replacements for hotends from Slice Engineering, E3D Online V6/Volcano, RepRap, Prusa, the popular Micro Swiss, Mosquito Hotend, Voron Dragon, and Luke Labs Chube High Flow Hotends.",
    "published_at": "2021-08-19T20:54:10+10:00",
    "updated_at": "2026-02-16T22:13:01+10:00",
    "products_count": 31
  },
  {
    "id": 271427698857,
    "title": "3D Printer Heater Cartridge",
    "handle": "3d-printer-heater-cartridge",
    "description": "Explore our range of high-quality heater cartridges for 3D printer hotends. We stock a variety of direct replacements for popular brands such as Creality, Prusa, E3D V6, Volcano, Artillery, and Bambu Labs. Our inventory includes commonly used 24V and 12V heater cartridges with wattages up to 120W, available in standard 20mm and 6mm sizes.\nAt DREMC, we also offer universal options from our DrHotSwap range, designed for legacy 3D printers like Ender 3, Ender 5, CR10, and Prusa, as well as DIY 3D printers These cartridges feature a convenient small module that can be easily replaced or upgrade wattage at the toolhead without the need to re-run wiring through cable chains or sleeves, enabling quicker swaps and minimal downtime.\nAdditionally, we offer a range of heater wattages and voltages. If you wish to push higher temperatures or achieve greater flow within your high-flow hotend, a larger heater will be required to keep your materials adequately flowing.",
    "published_at": "2021-07-08T15:00:51+10:00",
    "updated_at": "2026-02-16T22:13:01+10:00",
    "products_count": 42
  },
  {
    "id": 277338325161,
    "title": "3D Printer Hot-end Accessories",
    "handle": "3d-printer-hotend-accessories",
    "description": "DREMC stocks a large range of 3D printer hotends suitable for various printers, including Creality, Bambu, Prusa, Anycubic, Elegoo, Sovol and DIY Voron models. We offer products from original manufacturers to ensure seamless drop-in replacements. The hotend is one of the most vital components, responsible for melting materials. We provide options for higher flow rates, increased temperatures, and enhanced reliability, minimising downtime and extending your printer's capabilities upgrades in additional OEM replacement hotends parts.\nOur collection includes complete hotend assemblies as well as individual subcomponents such as heater blocks, heat sinks, silicon socks, thermistors, and heater cartridges. This allows you to keep or replace specific parts when needed or quickly swap out an entire hotend assembly.\nBased in Brisbane, Australia, DREMC ensures minimal downtime for your printing needs with fast dispatch, accurate and transparent stock counts, and a wide selection of hotends that cater to the most common printers and customised solutions.",
    "published_at": "2021-09-14T16:51:00+10:00",
    "updated_at": "2026-02-17T22:12:50+10:00",
    "products_count": 319
  },
  {
    "id": 273248649385,
    "title": "3D Printer Hotend Heater block",
    "handle": "3d-printer-heater-block",
    "description": "Explore our range of high-quality heater blocks for your 3D printing needs at DREMC. We offer a variety of options, including V6, MK8, and specific Creality 3D printer heater blocks, available in both standard aluminum alloy and high-temperature plated copper materials. Our inventory includes OEM and higher-quality aftermarket options from leading brands such as Micro Swiss, TriangleLabs, and Slice Engineering (Copper Head).\nAdditionally, we stock replacement heater blocks for all hotends in our inventory, ensuring you have the necessary components on hand to address issues like filament blobs. Our selection features replacements for hotends from Slice Engineering, E3D Online V6/Volcano, RepRap, Prusa, the popular Micro Swiss, Mosquito Hotend, Voron Dragon, Rapido Hotend to name a few.",
    "published_at": "2021-07-27T23:24:15+10:00",
    "updated_at": "2026-02-14T22:13:49+10:00",
    "products_count": 40
  },
  {
    "id": 274797232297,
    "title": "3D Printer Hotend Silicon Socks",
    "handle": "3d-printer-silicon-socks",
    "description": "Explore our range of high-quality silicon socks for 3D printer hotend heater blocks. We offer a selection of OEM silicon socks from Creality to ensure the best fit and compatibility, as well as aftermarket options for various hotends, including V6, RepRap/Volcano, Dragon, Bambu Hotends from the X1/P1, A1, and H2 Series and Micro Swiss FlowTech Hotend. \nFor most hotends in our inventory, we provide replacement silicon socks. Over time, especially near their operating limits, silicon socks can degrade and become brittle, necessitating replacement. This is essential to prevent plastic build-up around the hotend, which can lead to filament blobs during printing.",
    "published_at": "2021-08-11T22:33:32+10:00",
    "updated_at": "2026-02-15T22:14:54+10:00",
    "products_count": 46
  },
  {
    "id": 286929191081,
    "title": "3D Printer Kits",
    "handle": "3d-printer-kits",
    "description": "DREMC proudly stocks a diverse range of high-quality 3D Printer Kits from LDO and DREMC, designed for DIY enthusiasts and builders. Embrace the thrill of constructing your very own 3D printer from scratch and unlock your creativity!\nKey Features\n\n\nExciting DIY Experience: Our kits provide everything you need to create a fully functional 3D printer, allowing you to dive into the hands-on aspect of 3D printing.\n\n\nPopular Open-Source Projects: We offer well-regarded open-source projects like Voron Design, ensuring that each project comes with comprehensive documentation and robust community support.\n\n\nHigh-Quality Components: Each kit features premium parts that guarantee durability and reliability, enhancing your 3D printing experience.\n\n\nFeatured Kits\nWe stock a variety of LDO Motor Production Kits along with our own exclusive DREMC Projects, including:\n\n\nVoron: Known for its high-performance designs, the Voron project offers a range of 3D printers to suit different needs and sizes. \n\n\nZero G: Upgrade Ender 5 Series printers with ZeroG innovative conversion kits for increased speed and accuracy into modern Core XY Printer. \n\n\nPositron: A portable solution for those on the go, combining compactness with exceptional performance.\n\n\nBox Turtle: A DIY Bambu AMS Style multi materials system. \n\n\nRolohuan: Offering a range of cost effective printer build/conversion, with their latest Delta Flyer a small delta 3d printer.  \n\n\nMicron Ant: Perfect for those looking for smaller form factor and build size of Voron 3D Printer.",
    "published_at": "2022-07-19T09:27:36+10:00",
    "updated_at": "2026-02-17T22:12:50+10:00",
    "products_count": 25
  },
  {
    "id": 277447803049,
    "title": "3D Printer Mainboards",
    "handle": "3d-printer-mainboard",
    "description": "Find the right replacement mainboard for your 3D printer or upgrade your current printer with a powerful mainboard upgrade!\nIn our range, you will find a number of powerful mainboards with which you can operate even the most demanding user interfaces - integrate external components such as LEDs, additional motor driver, silent driver, replaceable drivers- and print worry-free",
    "published_at": "2021-09-15T23:25:57+10:00",
    "updated_at": "2026-02-17T22:12:50+10:00",
    "products_count": 94
  },
  {
    "id": 276374683817,
    "title": "3D Printer Parts",
    "handle": "3d-printer-parts",
    "description": "At DREMC, we stock a large range of 3D printing parts – from tools to tuning parts. Ideal for hobbyists and professional. Locally stocked in Australia.",
    "published_at": "2021-09-02T18:10:56+10:00",
    "updated_at": "2026-02-18T16:54:01+10:00",
    "products_count": 1513
  },
  {
    "id": 267169726633,
    "title": "3D Printer Thermistors",
    "handle": "3d-printer-thermistor",
    "description": "Explore our range of high-quality thermistors for 3D printer hotends and beds. We stock a variety of direct replacements for popular brands such as Creality, Prusa, E3D V6, Volcano, Artillery, and Bambu Labs. Our inventory includes the commonly used 100K and 104NT thermistor types, as well as options like PT1000 and PT100, which are suitable for high-temperature printing up to 450-500°C.\nAt DREMC, we also offer universal options from our DrHotSwap range, designed for legacy 3D printers like Ender 3, Ender 5, CR10, and Prusa, as well as DIY 3D printers. These feature a convenient small module that can be replaced at the toolhead without needing to re-run wiring through cable chains or sleeves, allowing for quicker swaps and minimal downtime.",
    "published_at": "2021-05-14T11:57:38+10:00",
    "updated_at": "2026-02-16T22:13:01+10:00",
    "products_count": 51
  },
  {
    "id": 319733661865,
    "title": "3D Printer Toolheads",
    "handle": "3d-printer-toolheads",
    "description": "The 3D Printer Complete Tool Heads collection offers a comprehensive solution for users seeking a simple, efficient replacement for their entire print head assembly. This “nuclear option” is designed for those who prefer to replace the whole tool head with one quick and easy purchase, ensuring minimal downtime and hassle.\nAlongside our complete assemblies, we also stock a variety of individual sub-assemblies and components. This is ideal for users who prefer to perform specific repairs or upgrades, enhancing customisability and allowing for tailored requirements. Our inventory includes:\n\n\nHotends: High-quality hotends designed for optimal melting and extrusion of filament, accommodating a wide range of materials.\n\nThermistors: Precision temperature sensors that provide accurate readings for consistent print quality.\n\nHeater Cartridges: Essential elements for maintaining the necessary temperature with range of style and wattage to suit most applications\n\nHeat Breaks: Critical components to prevent heat creep, ensuring smooth transitions within the hotend, which can wear when printing abrasive carbon/glass fibre materials. \n\nHeater Blocks: Durable and efficient blocks designed to house the heater cartridge and thermistor securely.\n\nSilicone Covers: Protective silicone sleeves that insulate the heat block, minimising heat loss and enhancing safety. Overtime at temperature these can harden and require replacing once cracks occurs.\n\nNozzles: Various nozzle sizes and types to suit different filament materials and printing needs.",
    "published_at": "2025-08-29T21:53:05+10:00",
    "updated_at": "2026-02-14T22:13:50+10:00",
    "products_count": 23
  },
  {
    "id": 273411244201,
    "title": "3D Printer Tools",
    "handle": "3d-printer-tools-and-general-spares",
    "description": "3D Printer related tools and general spares parts such as grub screw, bolts, nuts, thread inserts, torque wrench and many more.",
    "published_at": "2021-07-29T23:34:08+10:00",
    "updated_at": "2026-02-17T22:12:50+10:00",
    "products_count": 50
  },
  {
    "id": 277446459561,
    "title": "3D Printer Wearing Parts",
    "handle": "3d-printer-wearing-parts",
    "description": "Shop our extensive selection of 3D printer wearing or consumable parts, ideal for maintenance and repairs. We offer trusted components stocked locally in Australia, suitable for a wide variety of printers, including Voron, DIY builds, Bambu, and Creality.\nWhat We Offer\n\n\nFans: Keep your printer cool and operating efficiently with high-quality fans designed for optimal airflow and performance.\n\n\nExtruders: Upgrade or replace your extruder for better filament control and improved printing precision or wear and tear. \n\n\nHotends: Our hotends are essential for achieving reliable temperature regulation and consistent extrusion, such as each sub component, consumable like thermal paste. \n\n\nSpare Parts: Stock up on essential spare parts to ensure your printer remains in peak condition and ready for any DIY 3D Printer project.\n\n\nMotion Components: Enhance the movement and accuracy of your printer with quality motion components designed for durability and reliability such as linear rails, timing belts, bearings and consumable such as grease.",
    "published_at": "2021-09-15T23:08:46+10:00",
    "updated_at": "2026-02-17T22:12:50+10:00",
    "products_count": 234
  },
  {
    "id": 245759967401,
    "title": "3D Printers Nozzles",
    "handle": "3d-printers-nozzles",
    "description": "DREMC offers a large range of high-quality 3D printer nozzles designed for various applications, from brass to abrasive hardened steel. Our nozzles are compatible with multiple 3D printer hotends, including popular models from Creality such as MK8, Ender 3 V3 SE, K1/K2 Unicorn, CR-10S Pro (0.75mm Pitch) as well as RepRap models (V6, Volcano), Bambu TZ Style (TZ Style Nozzle), Micro Swiss Flow Tech Hotends, E3D Online (Revo) and more!\nWe stock a variety of sizes and materials to accommodate most printing materials. Additionally, we offer the official Bondtech CHT nozzle, which enhances your existing hotend's volumetric flow rate and layer adhesion without the need to replace your hotend.",
    "published_at": "2021-02-11T20:59:18+10:00",
    "updated_at": "2026-02-17T22:12:50+10:00",
    "products_count": 91
  },
  {
    "id": 245761474729,
    "title": "3D Printing Consumables – Filament",
    "handle": "3d-consumable",
    "description": "Stock up on essential 3D printing and resin consumables such as 3D Printing 1.75mm filament, thermal paste, bed adhesives, release film for resin. All you need for flawless prints, every time, well almost everytime.",
    "published_at": "2021-02-11T21:29:07+10:00",
    "updated_at": "2026-02-17T22:12:50+10:00",
    "products_count": 137
  },
  {
    "id": 282397180073,
    "title": "ABS and ASA 1.75mm Filament",
    "handle": "abs-asa-filament-1-75mm",
    "description": "ABS (Acrylonitrile Butadiene Styrene) and ASA (Acrylonitrile Styrene Acrylate) filament, known for their toughness and resistance to heat and UV (ASA), making them ideal for outdoor and functional prints. These filaments are perfect for projects that demand durability and reliability.\nKey Features and Applications\n\nABS and ASA filaments are suitable for projects that require:\n\nHigh impact resistance\nHeat resistance\nUV resistance (ASA)\nDurability and reliability\n\n\nIdeal applications include:\n\nOutdoor functional prints\nIndustrial parts\nAutomotive components\nConsumer products\n\n\n\nImproving ABS Weatherability and UV Resistance\nTo enhance the weatherability and UV resistance of ABS prints, consider the following options:\n\nClear coat or paint/spray the printed part\nSuitable for light UV exposure, such as under shade (ABS)\nNote that ASA filament already offers improved UV resistance compared to ABS\n\nBenefits and Considerations\nWhen working with ABS and ASA filaments, consider the following benefits and factors:\n\nBenefits:\n\nHigh durability and reliability\nResistance to heat and UV (ASA)\nSuitable for outdoor and functional prints\n\n\nConsiderations:\n\nMay require post-processing for improved weatherability and UV resistance (ABS)\nASA filament may be more suitable for applications with high UV exposure\n\n\n\nWe offer a variety of sparkle ASA/ABS as well as regular options from DREMC and Polymaker. Additionally, our range includes fiber-reinforced filaments, both glass and carbon, suitable for a wide range of applications, including DIY Voron printed parts and industrial projects. Experience exceptional performance and versatility with our high-quality filaments!\n\n\n\n\nAre you feeling overwhelmed by choices? Need assistance selecting the best materials for your next project or product? Reach out to us! We’re happy to recommend the most suitable materials to meet your specific needs and ensure your project’s success. Feel free to contact us for personalised suggestions!",
    "published_at": "2022-02-07T20:21:30+10:00",
    "updated_at": "2026-02-17T22:12:50+10:00",
    "products_count": 26
  },
  {
    "id": 304038346921,
    "title": "AJAX-3D",
    "handle": "ajax3d",
    "description": "Discover the innovative world of AJAX3D, a leading provider of high-quality 3D printing solutions. Our collection features a range of products designed to enhance your 3D printing experience. From durable printing materials to advanced printing technologies, we've got you covered. Explore the possibilities of 3D printing with AJAX3D.",
    "published_at": "2024-06-10T11:14:32+10:00",
    "updated_at": "2026-02-05T22:13:20+10:00",
    "products_count": 1
  },
  {
    "id": 305037508777,
    "title": "Antclabs",
    "handle": "antclabs",
    "description": "Explore our range of ANTCLABS products, known for their innovative solutions in the 3D printing industry. We offer high-quality components designed to enhance your printing experience, including advanced auto bed leveling sensors. ANTCLABS products are crafted for performance and reliability, making them ideal for both hobbyists and professionals seeking to improve their 3D printing setups.",
    "published_at": "2024-07-12T21:32:48+10:00",
    "updated_at": "2026-02-17T22:12:50+10:00",
    "products_count": 1
  },
  {
    "id": 311117775017,
    "title": "Anycubic",
    "handle": "anycubic",
    "description": "Explore our selection of original Anycubic 3D printer spare parts specifically designed for the latest Kobra 3 and Kobra S1 3D printers. Our collection includes essential components such as hotends, extruders, and electronics to keep your printer operating at peak performance.\nOEM Assurance\nWhere applicable, our parts are labeled as OEM (Original Equipment Manufacturer) and sourced directly from Anycubic. Each part includes a part number, allowing you to verify compatibility easily and ensuring a seamless replacement experience.\nDo you need a quote for a something not in stock or listed on our site from the Anycubic? Feel free to reach out to us for a quote. Net payment is available for EDU/Government and Private Business (upon application/approval). More information can be found here.",
    "published_at": "2025-01-17T19:20:45+10:00",
    "updated_at": "2026-02-17T22:49:51+10:00",
    "products_count": 27
  },
  {
    "id": 311117742249,
    "title": "Anycubic Kobra 3 Spare Parts",
    "handle": "anycubic-kobra-3-spare-parts",
    "description": "Discover a comprehensive range of high-quality spare parts specifically designed for the Anycubic Kobra 3 3D printer. Whether you’re looking to maintain optimal performance, replace worn-out components, or enhance your printer's capabilities, our collection has everything you need.\nOEM Parts\nWe primarily focus on offering Original Equipment Manufacturer (OEM) parts, ensuring that each component fits seamlessly and maintains the integrity of your printer. Our OEM offerings include:\n\n\nPrint Heads(toolhead): Replace your old or malfunctioning print head, in case a filament blobs or you need to replace multi part and its more ecommical and quicker to replace with complete toolhead print head. \n\nHotends: Replace your hotend with an OEM option that ensures compatibility\n\nCooling Fans: Keep your prints in top shape with original cooling fans designed direct plug and play without the need slice/crimp connectors to suit. \n\nMotherboard: For those experiencing issues like stepper motor, bed issues after replacing those components, a replacement motherboard will restore your printer to optimal functionality.\n\nAftermarket Upgrades\nIn addition to OEM parts, we also provide a selection of aftermarket upgrades that can enhance your 3D printing experience. These parts are designed to offer improved performance, additional features, or greater flexibility in your printing projects. Some popular upgrades include:\n\n\nCeramic TZ Hotend Kits: Perfect for those looking to print at higher temperatures without concerns about heat creep, these kits allow for a broader range of materials. More Information: https://store.dremc.com.au/blogs/news/anycubic-kobra-3-hotend-comparison-stock-vs-ceramic-hotend-tz-upgrade\n\n\nDo you need a quote for a something not in stock or listed on our site from the Anycubic Kobra 3? Feel free to reach out to us for a quote. Net payment is available for EDU/Government and Private Business (upon application/approval). More information can be found here.",
    "published_at": "2025-01-17T19:17:06+10:00",
    "updated_at": "2026-02-16T22:13:01+10:00",
    "products_count": 17
  },
  {
    "id": 314979844265,
    "title": "Anycubic Kobra S1 Spare Parts",
    "handle": "anycubic-kobra-s1-spare-parts",
    "description": "Explore our extensive selection of spare parts for the Anycubic Kobra S1 3D printer. Whether you're looking for replacements, upgrades, or simply to keep your printer in optimal condition, our collection features both genuine OEM parts and high-quality aftermarket options.\nQuality Components\nAll parts in our range are either genuine or carefully sourced aftermarket alternatives, ensuring you receive only the best for your printer. We pride ourselves on offering:\n\n\nOEM Parts: Maintain the integrity of your Kobra S1 with original parts designed for perfect compatibility and reliability.\n\nAftermarket Upgrades: Enhance your printing experience with premium aftermarket components that provide additional benefits or improved functionality.\n\nLocal Availability\nEvery part is in stock locally in Brisbane, Australia, allowing for fast dispatch and delivery times. Our focus on local inventory means you can get back to printing quickly without the long wait times associated with international shipping.\nDo you need a quote for a something not in stock or listed on our site from the Anycubic Kobra S1? Feel free to reach out to us for a quote. Net payment is available for EDU/Government and Private Business (upon application/approval). More information can be found here.",
    "published_at": "2025-04-19T11:42:02+10:00",
    "updated_at": "2026-02-17T22:49:51+10:00",
    "products_count": 19
  }
]